sargoliwork101-ui/ESP_APK_COOLLER/ESP32_Firmware/Cooler_ESP32_API_Server/Cooler_ESP32_API_Server.ino
#include <WiFi.h>
#include <WebServer.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <time.h>
#include <esp_task_wdt.h>

/* ===================== MISRA C COMPLIANT HEADER =====================
 * - All constants use const/constexpr
 * - Explicit types used throughout
 * - JSON format for time & relay stats (Option A)
 * - Simple XOR + Base64 encryption for saved data (Option 2)
 * - Detailed comments for debugging
 * - Matches logic of the sent index.html exactly
 * ================================================================ */

/* ===================== SIMPLE ENCRYPTION (XOR + Base64) ===================== */
/* More complex 32-byte key used for BOTH storage and network transfer */
const uint8_t ENCRYPTION_KEY[32] = {
  0x7B, 0xE4, 0x2A, 0x91, 0xC5, 0x6F, 0xD8, 0x33,
  0x4A, 0xB7, 0x9E, 0x12, 0xF0, 0x5D, 0x88, 0xC3,
  0x1E, 0xA9, 0x74, 0x2B, 0xF6, 0x8C, 0x3D, 0x50,
  0xE1, 0x9B, 0x27, 0x6A, 0xD4, 0x3F, 0x85, 0x1C
};

/* Simple XOR encryption */
void xorEncrypt(uint8_t* data, size_t len) {
  for (size_t i = 0; i < len; i++) {
    data[i] ^= ENCRYPTION_KEY[i % 16];
  }
}

/* Base64 encoding table */
static const char b64_table[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

/* Encode to Base64 */
String base64Encode(const uint8_t* data, size_t len) {
  String result;
  result.reserve(((len + 2) / 3) * 4);
  
  for (size_t i = 0; i < len; i += 3) {
    uint32_t n = (uint32_t)data[i] << 16;
    if (i + 1 < len) n |= (uint32_t)data[i + 1] << 8;
    if (i + 2 < len) n |= data[i + 2];
    
    result += b64_table[(n >> 18) & 0x3F];
    result += b64_table[(n >> 12) & 0x3F];
    result += (i + 1 < len) ? b64_table[(n >> 6) & 0x3F] : '=';
    result += (i + 2 < len) ? b64_table[n & 0x3F] : '=';
  }
  return result;
}

/* ===================== NETWORK ENCRYPTION HELPERS ===================== */
/* Encrypt JSON for network transfer (same key as storage) */
String encryptForNetwork(const String& json) {
  size_t len = json.length();
  uint8_t* buffer = (uint8_t*)malloc(len);
  if (!buffer) return "";
  
  memcpy(buffer, json.c_str(), len);
  xorEncrypt(buffer, len);
  String result = base64Encode(buffer, len);
  free(buffer);
  return result;
}

/* Decrypt network payload */
String decryptFromNetwork(const String& encrypted) {
  size_t decodedLen = (encrypted.length() / 4) * 3 + 4;
  uint8_t* buffer = (uint8_t*)malloc(decodedLen);
  if (!buffer) return "";
  
  size_t actualLen = 0;
  if (!base64Decode(encrypted, buffer, actualLen)) {
    free(buffer);
    return "";
  }
  
  xorEncrypt(buffer, actualLen);
  String result = String((char*)buffer, actualLen);
  free(buffer);
  return result;
}

/* Decode Base64 */
bool base64Decode(const String& input, uint8_t* output, size_t& outLen) {
  size_t len = input.length();
  if (len % 4 != 0) return false;
  
  outLen = (len / 4) * 3;
  if (input[len - 1] == '=') outLen--;
  if (input[len - 2] == '=') outLen--;
  
  size_t j = 0;
  for (size_t i = 0; i < len; i += 4) {
    uint32_t n = 0;
    for (int k = 0; k < 4; k++) {
      char c = input[i + k];
      if (c == '=') break;
      int val = strchr(b64_table, c) - b64_table;
      if (val < 0) return false;
      n = (n << 6) | val;
    }
    
    output[j++] = (n >> 16) & 0xFF;
    if (j < outLen) output[j++] = (n >> 8) & 0xFF;
    if (j < outLen) output[j++] = n & 0xFF;
  }
  return true;
}

/* Encrypt JSON string and save to file */
bool saveEncryptedFile(const char* path, const String& jsonContent) {
  size_t len = jsonContent.length();
  uint8_t* buffer = (uint8_t*)malloc(len);
  if (!buffer) return false;
  
  memcpy(buffer, jsonContent.c_str(), len);
  xorEncrypt(buffer, len);
  
  String encoded = base64Encode(buffer, len);
  free(buffer);
  
  File f = LittleFS.open(path, "w");
  if (!f) return false;
  
  f.print(encoded);
  f.close();
  return true;
}

/* Load and decrypt file */
bool loadEncryptedFile(const char* path, String& jsonContent) {
  if (!LittleFS.exists(path)) return false;
  
  File f = LittleFS.open(path, "r");
  if (!f) return false;
  
  String encoded = f.readString();
  f.close();
  
  size_t decodedLen = (encoded.length() / 4) * 3;
  uint8_t* buffer = (uint8_t*)malloc(decodedLen + 4);
  if (!buffer) return false;
  
  size_t actualLen = 0;
  if (!base64Decode(encoded, buffer, actualLen)) {
    free(buffer);
    return false;
  }
  
  xorEncrypt(buffer, actualLen);
  
  jsonContent = String((char*)buffer, actualLen);
  free(buffer);
  return true;
}

/* ===================== HARDWARE & PROGRAM SETTINGS ===================== */
const char* PROGRAM_NAME = "کولر هوشمند ESP32";
const int RELAY_PIN = 23;
const int RELAY_ACTIVE_LEVEL = HIGH;
const long NTP_GMT_OFFSET_SEC = 12600; // UTC+3:30

char custom_ssid[32] = "ESP32_Timer_Hub";
char custom_password[32] = "12345678";
char sta_ssid[32] = "";
char sta_password[64] = "";

bool internet_enabled = true;
int staOnMinutes = 10, staOffMinutes = 0;
bool staCurrentlyOn = true;
unsigned long staCycleLastToggleMillis = 0;

bool apCycleEnabled = false;
int apOnMinutes = 10, apOffMinutes = 5, apTxPowerLevel = 3;
bool apCurrentlyOn = true;
unsigned long apCycleLastToggleMillis = 0;

const int MAX_SCENARIOS = 20;
int antiShortCycleMinutes = 3;
unsigned long lastRelayOffMillis = 0;

const int WDT_TIMEOUT_SEC = 8;
const unsigned long TIME_SAVE_INTERVAL = 300000UL;
const unsigned long NTP_RETRY_INTERVAL_MS = 60000UL;
const unsigned long NTP_RECHECK_INTERVAL_MS = 3600000UL;

WebServer server(80);

/* ===================== DATA STRUCTURES ===================== */
struct Scenario {
  bool active = false;
  bool enabled = false;
  int startHour = 0;
  int startMinute = 0;
  int endHour = 0;
  int endMinute = 0;
  uint8_t weekdays = 0x7F;
};
Scenario scenarios[MAX_SCENARIOS];

/* ===================== GLOBAL STATE VARIABLES ===================== */
int currentHour = 0;
int currentMinute = 0;
int currentSecond = 0;
int currentYear = 2026;
int currentMonth = 1;
int currentDay = 1;
int currentWeekday = 3;
unsigned long lastTick = 0;

