sargoliwork101-ui/ESP_APK_COOLLER/ESP32_Firmware/Cooler_ESP32_API_Server/Cooler_ESP32_API_Server.ino
int manual_override = 0;

bool time_synchronized = false;
bool ntp_synced_this_boot = false;
bool ntpEverSucceeded = false;
bool ntpLastSuccessValid = false;
int ntpLastSuccessYear = 2026;
int ntpLastSuccessMonth = 1;
int ntpLastSuccessDay = 1;
int ntpLastSuccessHour = 0;
int ntpLastSuccessMinute = 0;
int ntpLastSuccessSecond = 0;
unsigned long lastNtpCheckMillis = 0;
bool ntpFirstCheckPending = true;
bool staEverConnectedThisBoot = false;
bool pendingReset = false;
unsigned long resetMillis = 0;

/* Request rate limiting */
unsigned long lastToggleManualRequest = 0;
unsigned long lastSaveScenarioRequest = 0;
unsigned long lastSyncRequest = 0;
unsigned long lastSaveApRequest = 0;
unsigned long lastSaveStaRequest = 0;
unsigned long lastSaveProtectionRequest = 0;
unsigned long lastSaveApCycleRequest = 0;
unsigned long lastStatusRequest = 0;

/* ===================== JSON-BASED PERSISTENCE (MISRA C + Option A) ===================== */
/* Time and relay statistics now use JSON format for security and consistency */
const char* TIME_FILE = "/time.json";
const char* RELAY_STAT_FILE = "/relaystat.json";
const char* NTP_META_FILE = "/ntp.json";

unsigned long timeSaveSeq = 0;
unsigned long lastTimeSaveMillis = 0;

unsigned long relaySwitchCount = 0;
unsigned long relayTotalOnSeconds = 0;
unsigned long relayOnSinceMillis = 0;
bool relayCurrentlyOnForStats = false;
int lastRelayStatState = -1;
unsigned long relayStatSaveSeq = 0;
unsigned long lastRelayStatSaveMillis = 0;

/* ===================== UTILITY FUNCTIONS ===================== */
void feedWatchdog() { 
  esp_task_wdt_reset(); 
}

void sendCORSHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS, PUT, DELETE");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type, Authorization, X-Requested-With");
}

void handleOptions() { 
  sendCORSHeaders(); 
  server.send(204); 
}

bool allowRequest(unsigned long &lastRequest, unsigned long minIntervalMs) {
  unsigned long now = millis();
  if ((lastRequest != 0) && ((unsigned long)(now - lastRequest) < minIntervalMs)) {
    sendCORSHeaders();
    server.send(429, "text/plain", "Too Many Requests");
    return false;
  }
  lastRequest = now;
  return true;
}

void setRelay(bool state) {
  digitalWrite(RELAY_PIN, state ? RELAY_ACTIVE_LEVEL : !RELAY_ACTIVE_LEVEL);
}

void applyApTxPower() {
  wifi_power_t p;
  switch (apTxPowerLevel) {
    case 0: p = WIFI_POWER_5dBm; break;
    case 1: p = WIFI_POWER_11dBm; break;
    case 2: p = WIFI_POWER_15dBm; break;
    default: p = WIFI_POWER_19_5dBm; break;
  }
  WiFi.setTxPower(p);
}

void setApRadioState(bool on) {
  if (on == apCurrentlyOn) return;
  if (on) {
    WiFi.softAP(custom_ssid, custom_password, 1, 0, 3);
    applyApTxPower();
  } else {
    WiFi.softAPdisconnect(true);
  }
  apCurrentlyOn = on;
}

void manageApCycle() {
  if (!apCycleEnabled) {
    if (!apCurrentlyOn) {
      setApRadioState(true);
      apCycleLastToggleMillis = millis();
    }
    return;
  }
  if (apCurrentlyOn && (WiFi.softAPgetStationNum() > 0)) {
    apCycleLastToggleMillis = millis();
    return;
  }
  unsigned long elapsed = millis() - apCycleLastToggleMillis;
  if (apCurrentlyOn && (elapsed >= (unsigned long)apOnMinutes * 60000UL)) {
    setApRadioState(false);
    apCycleLastToggleMillis = millis();
  } else if (!apCurrentlyOn && (elapsed >= (unsigned long)apOffMinutes * 60000UL)) {
    setApRadioState(true);
    apCycleLastToggleMillis = millis();
  }
}

/* ===================== WIFI & INTERNET ===================== */
void connectToInternetWiFi() {
  if (!internet_enabled || (strlen(sta_ssid) == 0)) {
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(false);
    return;
  }
  WiFi.setAutoReconnect(true);
  if (strlen(sta_password) > 0) {
    WiFi.begin(sta_ssid, sta_password);
  } else {
    WiFi.begin(sta_ssid);
  }
  configTime(NTP_GMT_OFFSET_SEC, 0, "ir.pool.ntp.org", "ntp.nic.ir", "pool.ntp.org");
  applyApTxPower();
}

void setStaConnectionState(bool on) {
  if (on) {
    staCurrentlyOn = true;
    staCycleLastToggleMillis = millis();
    connectToInternetWiFi();
  } else {
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(false);
    staCurrentlyOn = false;
    staCycleLastToggleMillis = millis();
    staEverConnectedThisBoot = false;
  }
}

void manageStaCycle() {
  if (!internet_enabled || (strlen(sta_ssid) == 0)) {
    if (staCurrentlyOn || (WiFi.status() == WL_CONNECTED)) {
      WiFi.setAutoReconnect(false);
      WiFi.disconnect(false);
      staCurrentlyOn = false;
    }
    staCycleLastToggleMillis = millis();
    return;
  }
  if (staOffMinutes == 0) {
    if (!staCurrentlyOn) setStaConnectionState(true);
    return;
  }
  unsigned long elapsed = millis() - staCycleLastToggleMillis;
  if (staCurrentlyOn && (elapsed >= (unsigned long)staOnMinutes * 60000UL)) {
    setStaConnectionState(false);
  } else if (!staCurrentlyOn && (elapsed >= (unsigned long)staOffMinutes * 60000UL)) {
    setStaConnectionState(true);
  }
}

/* ===================== NTP SYNCHRONIZATION ===================== */
void tryNtpSync() {
  if (!internet_enabled || !staCurrentlyOn || (strlen(sta_ssid) == 0)) return;
  
  unsigned long interval = ntp_synced_this_boot ? NTP_RECHECK_INTERVAL_MS : NTP_RETRY_INTERVAL_MS;
  if (!ntpFirstCheckPending && ((millis() - lastNtpCheckMillis) < interval)) return;
  if (WiFi.status() != WL_CONNECTED) return;

  lastNtpCheckMillis = millis();
  ntpFirstCheckPending = false;

  time_t now = time(nullptr);
  struct tm *tmInfo = localtime(&now);
  if (tmInfo && ((tmInfo->tm_year + 1900) >= 2024)) {
    currentHour = tmInfo->tm_hour;
    currentMinute = tmInfo->tm_min;
    currentSecond = tmInfo->tm_sec;
    currentYear = tmInfo->tm_year + 1900;
    currentMonth = tmInfo->tm_mon + 1;
    currentDay = tmInfo->tm_mday;
    currentWeekday = (tmInfo->tm_wday + 1) % 7;

    lastTick = millis();
    time_synchronized = true;
    ntp_synced_this_boot = true;
    ntpEverSucceeded = true;

