sargoliwork101-ui/ESP_APK_COOLLER/ESP32_Firmware/Cooler_ESP32_API_Server/Cooler_ESP32_API_Server.ino
    ntpLastSuccessYear = currentYear;
    ntpLastSuccessMonth = currentMonth;
    ntpLastSuccessDay = currentDay;
    ntpLastSuccessHour = currentHour;
    ntpLastSuccessMinute = currentMinute;
    ntpLastSuccessSecond = currentSecond;
    ntpLastSuccessValid = true;

    saveTimeSetting();
    saveNtpSuccessInfo();
  }
}

/* ===================== JSON-BASED SETTINGS (SECURE & CONSISTENT) ===================== */

/* Scenarios */
void loadScenarios() {
  String json;
  if (!loadEncryptedFile("/scenarios.json", json)) return;

  DynamicJsonDocument doc(4096);
  DeserializationError err = deserializeJson(doc, json);
  if (err) return;

  JsonArray array = doc.is<JsonArray>() ? doc.as<JsonArray>() : doc["items"].as<JsonArray>();
  int i = 0;
  for (JsonObject v : array) {
    if (i >= MAX_SCENARIOS) break;
    scenarios[i].active = v["active"] | false;
    scenarios[i].enabled = v.containsKey("en") ? (bool)v["en"] : scenarios[i].active;
    scenarios[i].startHour = v["sh"] | 0;
    scenarios[i].startMinute = v["sm"] | 0;
    scenarios[i].endHour = v["eh"] | 0;
    scenarios[i].endMinute = v["em"] | 0;
    scenarios[i].weekdays = v.containsKey("wd") ? (uint8_t)(v["wd"] | 0x7F) : 0x7F;
    i++;
  }
}

/* WiFi Settings */
void loadWiFiSettings() {
  String json;
  if (!loadEncryptedFile("/wifi.json", json)) return;

  StaticJsonDocument<512> doc;
  if (!deserializeJson(doc, json)) {
    if (doc.containsKey("ssid")) strncpy(custom_ssid, doc["ssid"], 31);
    if (doc.containsKey("pass")) strncpy(custom_password, doc["pass"], 31);
    if (doc.containsKey("sta_ssid")) strncpy(sta_ssid, doc["sta_ssid"], 31);
    if (doc.containsKey("sta_pass")) strncpy(sta_password, doc["sta_pass"], 63);
    internet_enabled = doc["internet"] | true;
    staOnMinutes = constrain(doc["staOnMinutes"] | staOnMinutes, 1, 1440);
    staOffMinutes = constrain(doc["staOffMinutes"] | staOffMinutes, 0, 1440);
    apCycleEnabled = doc["apCycleEnabled"] | false;
    apOnMinutes = constrain(doc["apOnMinutes"] | apOnMinutes, 1, 1440);
    apOffMinutes = constrain(doc["apOffMinutes"] | apOffMinutes, 1, 1440);
    apTxPowerLevel = constrain(doc["apTxPowerLevel"] | apTxPowerLevel, 0, 3);
  }
}

void saveWiFiSettings() {
  StaticJsonDocument<512> doc;
  doc["ssid"] = custom_ssid;
  doc["pass"] = custom_password;
  doc["sta_ssid"] = sta_ssid;
  doc["sta_pass"] = sta_password;
  doc["internet"] = internet_enabled;
  doc["staOnMinutes"] = staOnMinutes;
  doc["staOffMinutes"] = staOffMinutes;
  doc["apCycleEnabled"] = apCycleEnabled;
  doc["apOnMinutes"] = apOnMinutes;
  doc["apOffMinutes"] = apOffMinutes;
  doc["apTxPowerLevel"] = apTxPowerLevel;

  String json;
  serializeJson(doc, json);
  saveEncryptedFile("/wifi.json", json);   // Encrypted save
}

/* Override Setting (simple integer) */
void loadOverrideSetting() {
  if (!LittleFS.exists("/override.txt")) {
    manual_override = 0;
    return;
  }
  File f = LittleFS.open("/override.txt", "r");
  if (f) {
    String val = f.readString();
    manual_override = (val.toInt() == 1) ? 1 : 0;
    f.close();
  }
}

void saveOverrideSetting() {
  File f = LittleFS.open("/override.txt", "w");
  if (f) {
    f.print(manual_override);
    f.close();
  }
}

/* Protection Settings */
void loadProtectionSettings() {
  if (!LittleFS.exists("/protection.json")) return;
  File f = LittleFS.open("/protection.json", "r");
  if (f) {
    StaticJsonDocument<128> doc;
    if (!deserializeJson(doc, f)) {
      antiShortCycleMinutes = constrain(doc["minOffMinutes"] | 3, 0, 1440);
    }
    f.close();
  }
}

void saveProtectionSettings() {
  StaticJsonDocument<128> doc;
  doc["minOffMinutes"] = antiShortCycleMinutes;
  File f = LittleFS.open("/protection.json", "w");
  if (f) {
    serializeJson(doc, f);
    f.close();
  }
}

/* ===================== JSON TIME & RELAY STATS (NEW SECURE FORMAT) ===================== */

void saveTimeSetting() {
  timeSaveSeq++;
  StaticJsonDocument<256> doc;
  doc["hour"] = currentHour;
  doc["minute"] = currentMinute;
  doc["second"] = currentSecond;
  doc["sync"] = time_synchronized ? 1 : 0;
  doc["seq"] = timeSaveSeq;
  doc["year"] = currentYear;
  doc["month"] = currentMonth;
  doc["day"] = currentDay;
  doc["weekday"] = currentWeekday;

  String json;
  serializeJson(doc, json);
  saveEncryptedFile(TIME_FILE, json);   // Encrypted save
  lastTimeSaveMillis = millis();
}

void loadTimeSetting() {
  String json;
  if (!loadEncryptedFile(TIME_FILE, json)) {
    currentHour = 0; currentMinute = 0; currentSecond = 0;
    time_synchronized = false;
    return;
  }

  StaticJsonDocument<256> doc;
  if (!deserializeJson(doc, json)) {
    currentHour = doc["hour"] | 0;
    currentMinute = doc["minute"] | 0;
    currentSecond = doc["second"] | 0;
    time_synchronized = (doc["sync"] | 0) == 1;
    timeSaveSeq = doc["seq"] | 0;
    currentYear = doc["year"] | 2026;
    currentMonth = doc["month"] | 1;
    currentDay = doc["day"] | 1;
    currentWeekday = doc["weekday"] | 3;
  }
}

void saveRelayStats() {
  relayStatSaveSeq++;
  StaticJsonDocument<128> doc;
  doc["switchCount"] = relaySwitchCount;
  doc["onSeconds"] = relayTotalOnSeconds;
  doc["seq"] = relayStatSaveSeq;

  String json;
  serializeJson(doc, json);
  saveEncryptedFile(RELAY_STAT_FILE, json);   // Encrypted save
  lastRelayStatSaveMillis = millis();
}

void loadRelayStats() {
  String json;
  if (!loadEncryptedFile(RELAY_STAT_FILE, json)) {
    relaySwitchCount = 0;
    relayTotalOnSeconds = 0;
    return;
  }

  StaticJsonDocument<128> doc;
  if (!deserializeJson(doc, json)) {
    relaySwitchCount = doc["switchCount"] | 0;
    relayTotalOnSeconds = doc["onSeconds"] | 0;
    relayStatSaveSeq = doc["seq"] | 0;
  }
}

/* NTP Success Info (unchanged) */
void loadNtpSuccessInfo() {
  String json;
  if (!loadEncryptedFile(NTP_META_FILE, json)) return;

  StaticJsonDocument<192> doc;
  if (!deserializeJson(doc, json)) {
    ntpLastSuccessYear = doc["y"] | 2026;
    ntpLastSuccessMonth = doc["mon"] | 1;
    ntpLastSuccessDay = doc["d"] | 1;
    ntpLastSuccessHour = doc["h"] | 0;
    ntpLastSuccessMinute = doc["m"] | 0;
    ntpLastSuccessSecond = doc["s"] | 0;
    ntpLastSuccessValid = true;
    ntpEverSucceeded = true;
  }
}

