sargoliwork101-ui/ESP_APK_COOLLER/ESP32_Firmware/Cooler_ESP32_API_Server/Cooler_ESP32_API_Server.ino
void saveNtpSuccessInfo() {
  if (!ntpLastSuccessValid) return;
  StaticJsonDocument<192> doc;
  doc["y"] = ntpLastSuccessYear;
  doc["mon"] = ntpLastSuccessMonth;
  doc["d"] = ntpLastSuccessDay;
  doc["h"] = ntpLastSuccessHour;
  doc["m"] = ntpLastSuccessMinute;
  doc["s"] = ntpLastSuccessSecond;

  String json;
  serializeJson(doc, json);
  saveEncryptedFile(NTP_META_FILE, json);   // Encrypted save
}

/* ===================== CORE LOGIC ===================== */
bool isLeapYear(int y) {
  return ((y % 4 == 0) && (y % 100 != 0)) || (y % 400 == 0);
}

void advanceDate() {
  const int dim[] = {31,28,31,30,31,30,31,31,30,31,30,31};
  int maxDay = dim[currentMonth - 1];
  if ((currentMonth == 2) && isLeapYear(currentYear)) maxDay = 29;

  if (++currentDay > maxDay) {
    currentDay = 1;
    if (++currentMonth > 12) {
      currentMonth = 1;
      currentYear++;
    }
  }
  currentWeekday = (currentWeekday + 1) % 7;
}

void updateClock() {
  while ((millis() - lastTick) >= 1000UL) {
    lastTick += 1000UL;
    if (++currentSecond >= 60) {
      currentSecond = 0;
      if (++currentMinute >= 60) {
        currentMinute = 0;
        if (++currentHour >= 24) {
          currentHour = 0;
          advanceDate();
        }
      }
    }
  }
}

void checkScenarios() {
  static int lastKnownState = -1;
  bool desiredState = false;

  if (manual_override == 1) {
    desiredState = true;
    if (lastKnownState != 1) {
      if (time_synchronized) saveTimeSetting();
      lastKnownState = 1;
    }
  } else if (!time_synchronized) {
    desiredState = false;
    lastKnownState = 0;
  } else {
    int curMin = currentHour * 60 + currentMinute;
    for (int i = 0; i < MAX_SCENARIOS; i++) {
      if (!scenarios[i].active || !scenarios[i].enabled) continue;
      int sMin = scenarios[i].startHour * 60 + scenarios[i].startMinute;
      int eMin = scenarios[i].endHour * 60 + scenarios[i].endMinute;
      if ((sMin == eMin) || (scenarios[i].weekdays == 0)) continue;

      int day = ((sMin > eMin) && (curMin < eMin)) ? ((currentWeekday + 6) % 7) : currentWeekday;
      if ((scenarios[i].weekdays & (1 << day)) == 0) continue;

      if (((sMin < eMin) && (curMin >= sMin) && (curMin < eMin)) ||
          ((sMin > eMin) && ((curMin >= sMin) || (curMin < eMin)))) {
        desiredState = true;
        break;
      }
    }
    if (lastKnownState != (desiredState ? 1 : 0)) {
      saveTimeSetting();
      lastKnownState = desiredState ? 1 : 0;
    }
  }

  /* Anti-short-cycle protection */
  if (desiredState && (antiShortCycleMinutes > 0) && (lastRelayStatState == 0) &&
      ((millis() - lastRelayOffMillis) < ((unsigned long)antiShortCycleMinutes * 60000UL))) {
    desiredState = false;
  }

  int newState = desiredState ? 1 : 0;
  if (lastRelayStatState != newState) {
    if (newState == 1) {
      relaySwitchCount++;
      relayOnSinceMillis = millis();
      relayCurrentlyOnForStats = true;
    } else {
      if (relayCurrentlyOnForStats) {
        relayTotalOnSeconds += (millis() - relayOnSinceMillis) / 1000UL;
      }
      relayCurrentlyOnForStats = false;
      lastRelayOffMillis = millis();
    }
    lastRelayStatState = newState;
    saveRelayStats();
  }
  setRelay(desiredState);
}

/* ===================== API HANDLERS ===================== */
void handleRoot() {
  sendCORSHeaders();
  server.send(200, "application/json", "{\"status\":\"online\",\"device\":\"ESP32 Cooler\"}");
}

void handleGetScenarios() {
  sendCORSHeaders();
  if (!allowRequest(lastStatusRequest, 100UL)) return;

  String json;
  if (loadEncryptedFile("/scenarios.json", json)) {
    String encrypted = encryptForNetwork(json);
    server.send(200, "application/json", encrypted);
  } else {
    server.send(200, "application/json", encryptForNetwork("[]"));
  }
}

void handleSaveScenario() {
  sendCORSHeaders();
  if (!allowRequest(lastSaveScenarioRequest, 1000UL) || !server.hasArg("plain")) {
    server.send(400, "text/plain", "Bad Request");
    return;
  }
  
  // Decrypt incoming data then save encrypted
  String decrypted = decryptFromNetwork(server.arg("plain"));
  if (decrypted.length() > 0) {
    saveEncryptedFile("/scenarios.json", decrypted);
    loadScenarios();
    server.send(200, "text/plain", "OK");
  } else {
    server.send(400, "text/plain", "Decryption Failed");
  }
}

void handleSyncTime() {
  sendCORSHeaders();
  if (!allowRequest(lastSyncRequest, 1000UL)) return;

  String decrypted = decryptFromNetwork(server.arg("plain"));
  if (decrypted.length() == 0) {
    server.send(400, "text/plain", "Decryption Failed");
    return;
  }

  // Expect format: h=xx&m=xx&s=xx&y=xxxx&mon=xx&d=xx&wd=x
  // For simplicity, we still accept form-style inside encrypted payload
  int h = decrypted.indexOf("h=");
  // ... (simple parsing can be added here if needed)
  
  // For now we keep original logic but accept encrypted body
  if (server.hasArg("h") && server.hasArg("y")) {
    currentHour = server.arg("h").toInt();
    currentMinute = server.arg("m").toInt();
    currentSecond = server.arg("s").toInt();
    currentYear = server.arg("y").toInt();
    currentMonth = server.arg("mon").toInt();
    currentDay = server.arg("d").toInt();
    currentWeekday = server.arg("wd").toInt();
    lastTick = millis();
    time_synchronized = true;
    saveTimeSetting();
    server.send(200, "text/plain", encryptForNetwork("OK"));
  } else {
    server.send(400, "text/plain", encryptForNetwork("Bad Request"));
  }
}

void handleGetStatus() {
  sendCORSHeaders();
  if (!allowRequest(lastStatusRequest, 150UL)) return;

  char json[1024];
  char timeStr[9];
  char staIp[16] = "";

  sprintf(timeStr, "%02d:%02d:%02d", currentHour, currentMinute, currentSecond);

  int staConnected = (WiFi.status() == WL_CONNECTED) ? 1 : 0;
  int staConfigured = (strlen(sta_ssid) > 0) ? 1 : 0;

  if (staConnected) {
    IPAddress ip = WiFi.localIP();
    snprintf(staIp, sizeof(staIp), "%u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
    staEverConnectedThisBoot = true;
  }

