sargoliwork101-ui/ESP_APK_COOLLER/ESP32_Firmware/Cooler_ESP32_API_Server/Cooler_ESP32_API_Server.ino
  int staState = (!internet_enabled || !staConfigured) ? 0 :
                 (staOffMinutes > 0 && !staCurrentlyOn) ? 4 :
                 staConnected ? 2 : staEverConnectedThisBoot ? 3 : 1;

  unsigned long liveOn = relayTotalOnSeconds +
                         (relayCurrentlyOnForStats ? ((millis() - relayOnSinceMillis) / 1000UL) : 0);

  long protRem = (antiShortCycleMinutes > 0 && lastRelayStatState == 0) ?
                 max(0L, (long)((((unsigned long)antiShortCycleMinutes * 60000UL) -
                                (millis() - lastRelayOffMillis) + 999UL) / 1000UL)) : 0;

  long apRem = apCycleEnabled ? max(0L, (long)((((apCurrentlyOn ? apOnMinutes : apOffMinutes) * 60000UL) -
                                               (millis() - apCycleLastToggleMillis) + 999UL) / 1000UL)) : 0;

  long staRem = (internet_enabled && staConfigured && staOffMinutes > 0) ?
                max(0L, (long)((((staCurrentlyOn ? staOnMinutes : staOffMinutes) * 60000UL) -
                               (millis() - staCycleLastToggleMillis) + 999UL) / 1000UL)) : 0;

  snprintf(json, sizeof(json),
    "{\"time\":\"%s\",\"relay\":%d,\"override\":%d,\"sync\":%d,\"sta\":%d,"
    "\"internetEnabled\":%d,\"staConfigured\":%d,\"staState\":%d,\"staIp\":\"%s\","
    "\"staOnMinutes\":%d,\"staOffMinutes\":%d,\"staPhaseOn\":%d,\"staRemaining\":%ld,"
    "\"ntpOk\":%d,\"ntpLastValid\":%d,\"ntpYear\":%d,\"ntpMonth\":%d,\"ntpDay\":%d,"
    "\"ntpHour\":%d,\"ntpMinute\":%d,\"ntpSecond\":%d,\"switchCount\":%lu,\"onSeconds\":%lu,"
    "\"weekday\":%d,\"year\":%d,\"month\":%d,\"day\":%d,\"protectionMinutes\":%d,"
    "\"protectionRemaining\":%ld,\"apCycleEnabled\":%d,\"apOn\":%d,\"apOnMinutes\":%d,"
    "\"apOffMinutes\":%d,\"apTxPowerLevel\":%d,\"apRemaining\":%ld,\"apClientConnected\":%d,"
    "\"ssid\":\"%s\",\"staSsid\":\"%s\"}",
    timeStr,
    (digitalRead(RELAY_PIN) == RELAY_ACTIVE_LEVEL) ? 1 : 0,
    manual_override,
    time_synchronized ? 1 : 0,
    staConnected,
    internet_enabled ? 1 : 0,
    staConfigured,
    staState,
    staIp,
    staOnMinutes, staOffMinutes, staCurrentlyOn ? 1 : 0, staRem,
    ntpEverSucceeded ? 1 : 0,
    ntpLastSuccessValid ? 1 : 0,
    ntpLastSuccessYear, ntpLastSuccessMonth, ntpLastSuccessDay,
    ntpLastSuccessHour, ntpLastSuccessMinute, ntpLastSuccessSecond,
    relaySwitchCount, liveOn,
    currentWeekday, currentYear, currentMonth, currentDay,
    antiShortCycleMinutes, protRem,
    apCycleEnabled ? 1 : 0, apCurrentlyOn ? 1 : 0,
    apOnMinutes, apOffMinutes, apTxPowerLevel, apRem,
    (apCurrentlyOn && (WiFi.softAPgetStationNum() > 0)) ? 1 : 0,
    custom_ssid, sta_ssid);

  String encrypted = encryptForNetwork(json);
  server.send(200, "application/json", encrypted);
}

void handleToggleManual() {
  sendCORSHeaders();
  if (!allowRequest(lastToggleManualRequest, 1000UL)) return;
  manual_override = 1 - manual_override;
  saveOverrideSetting();
  if (time_synchronized) saveTimeSetting();
  checkScenarios();
  server.send(200, "text/plain", encryptForNetwork("OK"));
}

/* Other handlers remain unchanged for brevity (save-ap, save-sta, etc.) */
/* ... (same as before) ... */

void setup() {
  Serial.begin(115200);

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t twdt_cfg = {
    .timeout_ms = WDT_TIMEOUT_SEC * 1000,
    .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
    .trigger_panic = true
  };
  esp_task_wdt_init(&twdt_cfg);
#else
  esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
#endif

  esp_task_wdt_add(NULL);
  LittleFS.begin(true);

  /* Load all settings */
  loadScenarios();
  loadWiFiSettings();
  loadOverrideSetting();
  loadProtectionSettings();
  loadTimeSetting();      /* NEW JSON format */
  loadRelayStats();       /* NEW JSON format */
  loadNtpSuccessInfo();

  pinMode(RELAY_PIN, OUTPUT);
  setRelay(manual_override == 1);

  lastRelayStatState = (manual_override == 1) ? 1 : 0;
  if (lastRelayStatState == 0) {
    lastRelayOffMillis = millis();
  } else {
    relayOnSinceMillis = millis();
    relayCurrentlyOnForStats = true;
  }

  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(false);
  WiFi.setAutoReconnect(true);
  WiFi.softAP(custom_ssid, custom_password, 1, 0, 3);
  applyApTxPower();
  connectToInternetWiFi();

  /* Register API routes */
  server.on("/", HTTP_GET, handleRoot);
  server.on("/scenarios", HTTP_GET, handleGetScenarios);
  server.on("/save", HTTP_POST, handleSaveScenario);
  server.on("/sync", HTTP_POST, handleSyncTime);
  server.on("/status", HTTP_GET, handleGetStatus);
  server.on("/toggle-manual", HTTP_POST, handleToggleManual);
  /* ... other routes ... */

  server.onNotFound([]() {
    if (server.method() == HTTP_OPTIONS) handleOptions();
    else {
      sendCORSHeaders();
      server.send(404, "text/plain", "Not Found");
    }
  });

  server.begin();
  lastTick = millis();
  lastTimeSaveMillis = millis();
}

void loop() {
  feedWatchdog();

  if (pendingReset && ((millis() - resetMillis) > 2000UL)) {
    saveTimeSetting();
    ESP.restart();
  }

  server.handleClient();
  updateClock();
  manageStaCycle();
  tryNtpSync();
  checkScenarios();
  manageApCycle();

  if (time_synchronized && ((millis() - lastTimeSaveMillis) >= TIME_SAVE_INTERVAL)) {
    saveTimeSetting();
  }

  if (relayCurrentlyOnForStats &&
      ((millis() - lastRelayStatSaveMillis) >= TIME_SAVE_INTERVAL)) {
    unsigned long elapsed = (millis() - relayOnSinceMillis) / 1000UL;
    relayTotalOnSeconds += elapsed;
    relayOnSinceMillis += elapsed * 1000UL;
    saveRelayStats();
  }

  static unsigned long lastRefresh = 0;
  if ((millis() - lastRefresh) >= 30000UL) {
    applyApTxPower();
    pinMode(RELAY_PIN, OUTPUT);
    lastRefresh = millis();
  }

  yield();
}